doc: update text-based diagrams to mermaid chart
